theMachineMasse/MicrowaveFilterTuner/STM32/MotorControlSubSystem.c
/********************************************
*	Project: Microwave Filter Tuner
* File: MotorControlSubSystem
*	Date: January 27, 2020
*	Programmer(s): Matthew Rostad and Jarett Tremblay
* Sub-System: Motor Control Sub-System
*	Description: Contains the movement of the motors from Gcode commands
* Version: 1.0
*	
********************************************/

/* INCLUDES */
#include "MotorControlSubSystem.h"
#include "Communications.h"
#include "stm32f10x.h"
#include "VisualDisplaySubSystem.h"

//Globals
int motorsEnabledG = 0;
int xPosG = 0;
int yPosG = 0;
int zPosG = 0;
const int stepsPerMM = 100;
const int rampSize = 1900;
const int maxSpeed = 8000;
const int minSpeed = 200;

const int homeRampSize = 1900;
const int homeMaxSpeed = 4000;
const int homeMinSpeed = 200;

const int slowRampSize = 190;
const int slowMaxSpeed = 800;
const int slowMinSpeed = 40;

int pDegG = 0;
int encFlag = 0;
const int stepsPerDeg = 9;	//steps per degree = 
const int rampSizeDeg = 1900;
const int maxSpeedDeg = 4000;
const int minSpeedDeg = 2000;
const int slowRampSizeDeg = 190;
const int slowMaxSpeedDeg = 400;
const int slowMinSpeedDeg = 40;

//Z axis hitting screw
const int depthSlow = 80;	//percentage of depth to move down until slowing down
const int depthMax = 120;	//percentage of depth to move down past where screw should have been


/*******************************************
*	Function: motorInit
*	Programmer(s): Matthew Rostad
*	Date: February 20, 2020
*	Purpose: Initializes necessary motor GPIO pins
*	Parameters: N/A
*	Return value: N/A
*******************************************/
void motorInit(void){	
	
	
	//remap pins
	RCC->APB2ENR |= RCC_APB2ENR_AFIOEN;
	AFIO->MAPR |= AFIO_MAPR_SWJ_CFG_JTAGDISABLE;
	
	//motor GPIO init
	GPIOA->CRL |= GPIO_CRL_MODE7 ;
	GPIOA->CRL &= ~GPIO_CRL_CNF7 ;
	GPIOA->CRH |= GPIO_CRH_MODE8 | GPIO_CRH_MODE9 | GPIO_CRH_MODE10 | GPIO_CRH_MODE11 | GPIO_CRH_MODE12 | GPIO_CRH_MODE15;
	GPIOA->CRH &= ~GPIO_CRH_CNF8 & ~GPIO_CRH_CNF9 & ~GPIO_CRH_CNF10 & ~GPIO_CRH_CNF11 & ~GPIO_CRH_CNF12 & ~GPIO_CRH_CNF15;
	
	GPIOB->CRL |= GPIO_CRL_MODE6 | GPIO_CRL_MODE7;
	GPIOB->CRL &= ~GPIO_CRL_CNF6 & ~GPIO_CRL_CNF7;
	GPIOB->CRH |= GPIO_CRH_MODE8;
	GPIOB->CRH &= ~GPIO_CRH_CNF8;
	
	
	//disable steppers by defualt
	disableMotors();
	
}


/*******************************************
*	Function: encoderInit
* Programmer(s): Jarett Tremblay
*	Date: February 25, 2020
*	Purpose: Initializes necessary encoder GPIO pins
*	Parameters: N/A
*	Return value: N/A
*******************************************/

void encoderInit(void){	
	
	// encoder GPIO init
	GPIOB->CRH |= GPIO_CRH_CNF8_0;
	GPIOB->CRH &= ~GPIO_CRH_MODE8 & ~GPIO_CRH_CNF8_1;  
	
}

/*******************************************
*	Function: moveX
*	Programmer(s): Matthew Rostad
*	Date: February 20, 2020
*	Purpose: Moves the X axis the desired amount
*	Parameters: int movePosition
*	Return value: N/A
*******************************************/
void moveX(int movePosition){
	sendbyte(' ');
	sendbyte('X');
	printHex(movePosition);
	sendbyte(' ');
	lcdDisplayStatus(5);
	int moveAmount = movePosition - xPosG;			//amount to move based off desired position minus current position 
	if(motorsEnabledG){
		xPosG = movePosition;												//update the current position
	}
	
	moveMotor(1,moveAmount);
	
}

/*******************************************
*	Function: moveY
*	Programmer(s): Matthew Rostad
*	Date: February 20, 2020
*	Purpose: Moves the Y axis the desired amount
*	Parameters: int movePosition
*	Return value: N/A
*******************************************/
void moveY(int movePosition){
	sendbyte(' ');
	sendbyte('Y');
	printHex(movePosition);
	sendbyte(' ');
	lcdDisplayStatus(6);
	int moveAmount = movePosition - yPosG;			//amount to move based off desired position minus current position 
	if(motorsEnabledG){
		yPosG = movePosition;												//update the current position
	}
	
	moveMotor(2,moveAmount);
}

/*******************************************
*	Function: moveZ
*	Programmer(s): Matthew Rostad
*	Date: February 20, 2020
*	Purpose: Moves the Z axis the desired amount
*	Parameters: int movePosition
*	Return value: N/A
*******************************************/
void moveZ(int movePosition){
	sendbyte(' ');
	sendbyte('Z');
	printHex(movePosition);
	sendbyte(' ');
	lcdDisplayStatus(7);
	int moveAmount = movePosition - zPosG;			//amount to move based off desired position minus current position 
	if(motorsEnabledG){
		zPosG = movePosition;												//update the current position
	}
	
	moveMotor(3,moveAmount);
}

/*******************************************
*	Function: moveXSlow
*	Programmer(s): Matthew Rostad
*	Date: February 20, 2020
*	Purpose: Moves the X axis the desired amount at a slower speed
*	Parameters: int movePosition
*	Return value: N/A
*******************************************/
void moveXSlow(int movePosition){
	sendbyte(' ');
	sendbyte('X');
	sendbyte('S');
	printHex(movePosition);
	sendbyte(' ');
	lcdDisplayStatus(5);
	int moveAmount = movePosition - xPosG;			//amount to move based off desired position minus current position 
	if(motorsEnabledG){
		xPosG = movePosition;												//update the current position
	}
	
	moveMotorSlow(1,moveAmount);
}

/*******************************************
*	Function: moveYSlow
*	Programmer(s): Matthew Rostad
*	Date: February 20, 2020
*	Purpose: Moves the Y axis the desired amount at a slower speed
*	Parameters: int movePosition
*	Return value: N/A
*******************************************/
void moveYSlow(int movePosition){
	sendbyte(' ');
	sendbyte('Y');
	sendbyte('S');
	printHex(movePosition);
	sendbyte(' ');
	lcdDisplayStatus(6);
	int moveAmount = movePosition - yPosG;			//amount to move based off desired position minus current position 
	if(motorsEnabledG){
		yPosG = movePosition;												//update the current position
	}
	
	moveMotorSlow(2,moveAmount);
}

/*******************************************
*	Function: moveZSlow
*	Programmer(s): Matthew Rostad
*	Date: February 20, 2020
*	Purpose: Moves the Z axis the desired amount at a slower speed
*	Parameters: int movePosition
*	Return value: N/A
*******************************************/
void moveZSlow(int movePosition){
	sendbyte(' ');
	sendbyte('Z');
	sendbyte('S');
	printHex(movePosition);
	sendbyte(' ');
	lcdDisplayStatus(7);
	int moveAmount = movePosition - zPosG;			//amount to move based off desired position minus current position 
	if(motorsEnabledG){
		zPosG = movePosition;												//update the current position
	}
	
	moveMotorSlow(3,moveAmount);
}


