theMachineMasse/MicrowaveFilterTuner/STM32/MotorControlSubSystem.c
		//decel
		for(int i = 0; i < moveAmount/2; i++){
			speedAccel = maxSpeedReached -  accelRate*(i);
			delayTime = (1000000/speedAccel)/2;
			
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BS15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BS8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BS11;
			delayUs(delayTime);
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BR15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BR8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BR11;
			delayUs(delayTime);
			//check for limit switch hit
			if((GPIOA->IDR & GPIO_IDR_IDR1) == GPIO_IDR_IDR1){ lcdDisplayError(26); nonRecoverableError();}
			if((GPIOA->IDR & GPIO_IDR_IDR2) == GPIO_IDR_IDR2){ lcdDisplayError(25); nonRecoverableError();}
			if((GPIOA->IDR & GPIO_IDR_IDR3) == GPIO_IDR_IDR3){ lcdDisplayError(24); nonRecoverableError();}
			if((GPIOA->IDR & GPIO_IDR_IDR4) == GPIO_IDR_IDR4){ lcdDisplayError(23); nonRecoverableError();}
			if((GPIOA->IDR & GPIO_IDR_IDR5) == GPIO_IDR_IDR5){ lcdDisplayError(27); nonRecoverableError();}
			if((GPIOA->IDR & GPIO_IDR_IDR6) == GPIO_IDR_IDR6){ lcdDisplayError(28); nonRecoverableError();}
		}
		
	}
	
	
	
}




/*******************************************
*	Function: moveZScrew
*	Programmer(s): Matthew Rostad
*	Date: March 09, 2020
*	Purpose: Moves the z axis to align with screw
*	Parameters: int depth
*	Return value: N/A
*******************************************/
void moveZScrew(int depth){
	int delayTime;
	int speedAccel;
	int fastDepth = (depth * depthSlow) / 100;
	int maxDepth = (depth * depthMax) / 100;

	GPIOA->BSRR |= GPIO_BSRR_BS10;	//move away from home
	
	
	//accel
	int accelRate = (homeMaxSpeed - homeMinSpeed) / homeRampSize;
	for(int i = 0; i < homeRampSize; i++){
			speedAccel = homeMinSpeed + accelRate*(i);
			delayTime = (1000000/speedAccel)/2;
			GPIOA->BSRR |= GPIO_BSRR_BS11;
			delayUs(delayTime);
			GPIOA->BSRR |= GPIO_BSRR_BR11;
			delayUs(delayTime);
			zPosG++;
			if((GPIOC->IDR & GPIO_IDR_IDR10) == GPIO_IDR_IDR10) return;
	}
	
	//coast
		int coastSteps = fastDepth - homeRampSize*2;
		delayTime = (1000000/homeMaxSpeed)/2;
		for(int i = 0; i < coastSteps; i++){
			GPIOA->BSRR |= GPIO_BSRR_BS11;
			delayUs(delayTime);
			GPIOA->BSRR |= GPIO_BSRR_BR11;
			delayUs(delayTime);
			zPosG++;
			if((GPIOC->IDR & GPIO_IDR_IDR10) == GPIO_IDR_IDR10) return;
		}
		
		
		//coast at slow speed
		coastSteps = maxDepth - fastDepth;
		delayTime = (1000000/slowMaxSpeed)/2;
		for(int i = 0; i < coastSteps; i++){
			GPIOA->BSRR |= GPIO_BSRR_BS11;
			delayUs(delayTime);
			GPIOA->BSRR |= GPIO_BSRR_BR11;
			delayUs(delayTime);
			zPosG++;
			if((GPIOC->IDR & GPIO_IDR_IDR10) == GPIO_IDR_IDR10) return;
		}
}
	
	
	
/*******************************************
*	Function: enableMotors
*	Programmer(s): Matthew Rostad
*	Date: February 20, 2020
*	Purpose: Enables all stepper motors
*	Parameters: N/A
*	Return value: N/A
*******************************************/
void enableMotors(void){
	GPIOB->BSRR |= GPIO_BSRR_BR6;
	GPIOA->BSRR |= GPIO_BSRR_BR7;
	GPIOA->BSRR |= GPIO_BSRR_BR10;
	GPIOA->BSRR |= GPIO_BSRR_BR13;
	motorsEnabledG = 1;
}

/*******************************************
*	Function: disableMotors
*	Programmer(s): Matthew Rostad
*	Date: February 20, 2020
*	Purpose: Disables all stepper motors
*	Parameters: N/A
*	Return value: N/A
*******************************************/
void disableMotors(void){
	GPIOB->BSRR |= GPIO_BSRR_BS6;
	GPIOA->BSRR |= GPIO_BSRR_BS7;
	GPIOA->BSRR |= GPIO_BSRR_BS10;
	GPIOA->BSRR |= GPIO_BSRR_BS13;
	motorsEnabledG = 0;
}


/*******************************************
*	Function: homeMotors
*	Programmer(s): Matthew Rostad
*	Date: February 29, 2020
*	Purpose: Home X, Y and Z motors
*	Parameters: N/A
*	Return value: N/A
*******************************************/
void homeMotors(void){
 if(motorsEnabledG){	
	
	int delayTime;
	int speedAccel;
	int homeTimeout = 1000000;
	int timeoutCounter = 0;
	int axis;
	

	for(int i = 0; i < 3; i++){
		if(i == 0) axis = 3;	//z axis
		if(i == 1) axis = 1;	//x axis
		if(i == 2) axis = 2;	//y axis
		timeoutCounter = 0;
		//accel
		//move axis towards home
		if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BR12;
		else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BR7;
		else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BR10;
		int accelRate = (homeMaxSpeed - homeMinSpeed) / homeRampSize;
		for(int i = 0; i < homeRampSize; i++){
			speedAccel = homeMinSpeed + accelRate*(i);
			delayTime = (1000000/speedAccel)/2;
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BS15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BS8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BS11;
			delayUs(delayTime);
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BR15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BR8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BR11;
			delayUs(delayTime);
			
			//if(((GPIOA->IDR & GPIO_IDR_IDR1) != GPIO_IDR_IDR1) && ((GPIOA->IDR & GPIO_IDR_IDR3) != GPIO_IDR_IDR3) && ((GPIOA->IDR & GPIO_IDR_IDR5) != GPIO_IDR_IDR5)){
			if(((GPIOA->IDR & GPIO_IDR_IDR1) == GPIO_IDR_IDR1) || ((GPIOA->IDR & GPIO_IDR_IDR3) == GPIO_IDR_IDR3) || ((GPIOA->IDR & GPIO_IDR_IDR5) == GPIO_IDR_IDR5)){
				break;
			}
			}
		
		//coast
		delayTime = (1000000/homeMaxSpeed)/2;
		while(((GPIOA->IDR & GPIO_IDR_IDR1) != GPIO_IDR_IDR1) && ((GPIOA->IDR & GPIO_IDR_IDR3) != GPIO_IDR_IDR3) && ((GPIOA->IDR & GPIO_IDR_IDR5) != GPIO_IDR_IDR5)){
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BS15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BS8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BS11;
			delayUs(delayTime);
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BR15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BR8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BR11;
			delayUs(delayTime);
			timeoutCounter ++;
			if(timeoutCounter > homeTimeout){
				if     (axis == 1) lcdDisplayError(14);
				else if(axis == 2) lcdDisplayError(15);
				else if(axis == 3) lcdDisplayError(16);
				break;
				}
		}
		
		//slowly move away from the limit switch
		//move axis away from home
		if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BS12;
		else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BS7;
		else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BS10;
		
