theMachineMasse/MicrowaveFilterTuner/STM32/MotorControlSubSystem.c
		delayTime = (1000000/slowMaxSpeed)/2;
		for(int i = 0; i < 500; i++){
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BS15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BS8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BS11;
			delayUs(delayTime);
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BR15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BR8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BR11;
			delayUs(delayTime);
		}
		
		//slowly move towards limit switch until contact
		//move axis towards home
		if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BR12;
		else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BR7;
		else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BR10;
		delayTime = (1000000/slowMaxSpeed)/2;
		while(((GPIOA->IDR & GPIO_IDR_IDR1) != GPIO_IDR_IDR1) && ((GPIOA->IDR & GPIO_IDR_IDR3) != GPIO_IDR_IDR3) && ((GPIOA->IDR & GPIO_IDR_IDR5) != GPIO_IDR_IDR5)){
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BS15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BS8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BS11;
			delayUs(delayTime);
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BR15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BR8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BR11;
			delayUs(delayTime);
		}
		
		//slowly move away from the limit switch
		//move axis away from home
		if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BS12;
		else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BS7;
		else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BS10;
		
		delayTime = (1000000/slowMaxSpeed)/2;
		for(int i = 0; i < 250; i++){
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BS15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BS8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BS11;
			delayUs(delayTime);
			if     (axis == 1) GPIOA->BSRR |= GPIO_BSRR_BR15;
			else if(axis == 2) GPIOB->BSRR |= GPIO_BSRR_BR8;
			else if(axis == 3) GPIOA->BSRR |= GPIO_BSRR_BR11;
			delayUs(delayTime);
		}
		if     (axis == 1) xPosG = 0;
		else if(axis == 2) yPosG = 0;
		else if(axis == 3) zPosG = 0;
}
}
}

/*******************************************
*	Function: moveMotorDeg
* Programmer(s): Jarett Tremblay
*	Date: February 20, 2020
*	Purpose: Moves the motor the desired amount in degrees
*	Parameters: int axis, int movePosition
*	Return value: N/A
*******************************************/
void moveMotorDeg(int moveAmount){
	sendbyte('v');
	
	if(moveAmount > 0){																	//if move direction is positive set direction outputs high
		GPIOA->BSRR |= GPIO_BSRR_BR8;
	}
	else{																								//if move direction is negative set direction outputs low
		GPIOA->BSRR |= GPIO_BSRR_BS8;
		moveAmount = moveAmount * -1;											//if move direction is negative take the absolute value
	}
	
	moveAmount = (moveAmount * stepsPerDeg) / 10;				//convert move amount from degrees to steps
	

	printHex(moveAmount);
	sendbyte(' ');
	sendbyte(' ');
	
	
	if(moveAmount >= rampSizeDeg*2){												//if long move distance use accel, coast, devel ramp
		int speedAccel;
		int delayTime;
		
		//accel
		int accelRate = (maxSpeedDeg - minSpeedDeg) / rampSizeDeg;
		for(int i = 0; i < rampSizeDeg; i++){
			speedAccel = minSpeedDeg + accelRate*(i);
			delayTime = (1000000/speedAccel)/2;
			
			GPIOA->BSRR |= GPIO_BSRR_BS9;
			delayUs(delayTime);
			GPIOA->BSRR |= GPIO_BSRR_BR9;
			delayUs(delayTime);
		}
		
		//coast
		int coastSteps = moveAmount - rampSizeDeg*2;
		delayTime = (1000000/maxSpeedDeg)/2;
		for(int i = 0; i < coastSteps; i++){
			GPIOA->BSRR |= GPIO_BSRR_BS9;
			delayUs(delayTime);
			GPIOA->BSRR |= GPIO_BSRR_BR9;
			delayUs(delayTime);
			
		}
		
		//decel
		for(int i = 0; i < rampSizeDeg; i++){
			speedAccel = maxSpeedDeg -  accelRate*(i);
			delayTime = (1000000/speedAccel)/2;
			
			GPIOA->BSRR |= GPIO_BSRR_BS9;
			delayUs(delayTime);
			GPIOA->BSRR |= GPIO_BSRR_BR9;
			delayUs(delayTime);
		}
	}
	
	else{																									//if short move use accel, decel ramp
		int speedAccel;
		int delayTime;
		int maxSpeedReached;
		
		//accel
		int accelRate = (maxSpeedDeg - minSpeedDeg) / rampSizeDeg;
		for(int i = 0; i < moveAmount/2; i++){
			speedAccel = minSpeedDeg + accelRate*(i);
			maxSpeedReached = speedAccel;
			delayTime = (1000000/speedAccel)/2;
			
			GPIOA->BSRR |= GPIO_BSRR_BS9;
			delayUs(delayTime);
			GPIOA->BSRR |= GPIO_BSRR_BR9;
			delayUs(delayTime);
		}
		
		
		//decel
		for(int i = 0; i < moveAmount/2; i++){
			speedAccel = maxSpeedReached -  accelRate*(i);
			delayTime = (1000000/speedAccel)/2;
			
			GPIOA->BSRR |= GPIO_BSRR_BS9;
			delayUs(delayTime);
			GPIOA->BSRR |= GPIO_BSRR_BR9;
			delayUs(delayTime);
		}
	}
}

/*******************************************
*	Function: phiHome
* Programmer(s): Jarett Tremblay
*	Date: February 29, 2020
*	Purpose: Moves the motor the desired amount in degrees
*	Parameters: int axis, int movePosition
*	Return value: N/A
*******************************************/
void phiHome(){
	
	int moveAmount = 360; 															//move one full rotation
	int timeoutValue = 3240;														//(moveAmount * stepsPerDeg) / 10
	int timeoutCount = 0;																//timeout counter
		
	
	if(moveAmount > 0){																	//if move direction is positive set direction outputs high
		GPIOA->BSRR |= GPIO_BSRR_BS8;
	}
	else{																								//if move direction is negative set direction outputs low
		GPIOA->BSRR |= GPIO_BSRR_BR8;
		moveAmount = moveAmount * -1;											//if move direction is negative take the absolute value
	}
	
	moveAmount = (moveAmount * stepsPerDeg) / 10;				//convert move amount from degrees to steps
	
	printHex(moveAmount);
	sendbyte(' ');
	sendbyte(' ');
	
	lcdDisplayStatus(4);															  //status: homing phi
	
	if(moveAmount <= rampSizeDeg*2){										//if long move distance use accel, coast, devel ramp
		int speedAccel;
		int delayTime;
		
		//accel
		int accelRate = (maxSpeedDeg - minSpeedDeg) / rampSizeDeg;
		for(int i = 0; i < rampSizeDeg; i++){
			speedAccel = minSpeedDeg + accelRate*(i);
			delayTime = (1000000/speedAccel)/2;
			
			if ((GPIOB->IDR & GPIO_IDR_IDR9) == 0){
			
				GPIOA->BSRR |= GPIO_BSRR_BS9;
				
				timeoutCount++;
	
				if(timeoutCount >= timeoutValue){
					lcdDisplayError(13);
				}
								
